# Упражнение 1
# Создайте список из имен-строк. Затем добавьте в этот список два новых имени
# и удалите последнее имя. Выведите финальный список на консоль.

# sps_1 = ['one', 'two', 'three', 'four']
# sps_1.append('five')
# sps_1.append('six')
# print(sps_1)
# sps_1.pop()
# print(sps_1)

# Упражнение 4
# Напишите программу, которая удаляет дубликаты из списка.

from random import *

# sps_2 = []
# for i in range(10):
#     sps_2.append(randint(1,5))

# print(sps_2)
# sps_2.sort()
# print(sps_2)

# i = 0
# while i < len(sps_2) - 1:
#     if sps_2[i] == sps_2[i + 1]: 
#         sps_2.pop(i) 
#     else:
#         i += 1  
# print(sps_2)

# Упражнение 7
# Напишите программу, которая удаляет из списка чисел четные числа.

# sps_3 = [randint(1,50) for i in range(11)]
# print(sps_3)

# for i in range(len(sps_3) -1, -1, -1):
#     if sps_3[i] % 2 == 0:
#         sps_3.pop(i)
    
# print(sps_3)

# Упражнение 8
# Напишите функцию, которая принимает два списка и возвращает новый список, в котором каждый
# элемент представляет сумму соответствующих элементов обоих списков.

# sps_4 = [randint(1,100) for i in range(5)]
# sps_5 = [randint(1,100) for i in range(5)]
# sps_sum = []
# print(sps_4)
# print(sps_5)


# for i in range(len(sps_4)):
#     sps_sum.append(sps_4[i] + sps_5[i])
        
        
# print(sps_sum)

